; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	Star1 - direction
	Star5 - direction
	Star0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star6)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite3 Star0)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 image0)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 thermograph1)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Phenomenon14 image0)
))

)

; plan
1. (turn_to satellite3 star0 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star0)
   goals met: 1 of 10
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
3. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 10
4. (turn_to satellite1 phenomenon12 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 10
5. (take_image satellite1 phenomenon12 instrument2 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 2 of 10
6. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 10
7. (take_image satellite1 phenomenon11 instrument2 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 10
8. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 10
9. (turn_to satellite0 star2 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star2)
   goals met: 4 of 10
10. (take_image satellite1 phenomenon10 instrument2 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 5 of 10
11. (turn_to satellite1 phenomenon14 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon14)
   goals met: 5 of 10
12. (take_image satellite1 phenomenon14 instrument2 image0)
   added: (have_image phenomenon14 image0)
   goals met: 6 of 10
13. (turn_to satellite1 phenomenon8 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon8)
   goals met: 6 of 10
14. (take_image satellite1 phenomenon8 instrument2 image0)
   added: (have_image phenomenon8 image0)
   goals met: 7 of 10
15. (turn_to satellite1 star13 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star13)
   goals met: 7 of 10
16. (take_image satellite1 star13 instrument2 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 8 of 10
17. (turn_to satellite1 star7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star7)
   goals met: 8 of 10
18. (take_image satellite1 star7 instrument2 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 9 of 10
19. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
20. (take_image satellite1 star9 instrument2 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 10
